Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/
Rename the columns as per the description from this file:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names
Task:
Create a sql db from adult dataset and name it sqladb
1. Select 10 records from the adult sqladb
2. Show me the average hours per week of all men who are working in private sector
3. Show me the frequency table for education, occupation and relationship, separately
4. Are there any people who are married, working in private sector and having a masters
degree
5. What is the average, minimum and maximum age group for people working in
different sectors
6. Calculate age distribution by country
7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and
'capital-loss'

In [140]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series


df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',sep=",",header=None)
df.columns=['age','workclass','fnlwgt','education','educationNum','marital_status','occupation','relationship','race','sex','capital_gain','capital_loss','hours_per_week','native_country','income']

In [141]:
# Create a sql db from adult dataset and name it sqladb
import sqlite3 as db
from pandasql import sqldf
import sqlalchemy

from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqladb', echo=True)
df.to_sql('sqladb', engine, if_exists='replace')
connection = db.connect("sqladb")
cursor = connection.cursor()
cursor.execute('PRAGMA TABLE_INFO({})'.format("sqladb"))
cursor.fetchall()

2019-01-24 00:54:27,692 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1

INFO:sqlalchemy.engine.base.Engine:SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1

2019-01-24 00:54:27,692 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,692 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1

INFO:sqlalchemy.engine.base.Engine:SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1

2019-01-24 00:54:27,692 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,708 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("sqladb")

INFO:sqlalchemy.engine.base.Engine:PRAGMA table_info("sqladb")

2019-01-24 00:54:27,708 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,708 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("sqladb")

INFO:sqlalchemy.engine.base.Engine:PRAGMA table_info("sqladb")

2019-01-24 00:54:27,708 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,723 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name

INFO:sqlalchemy.engine.base.Engine:SELECT name FROM sqlite_master WHERE type='table' ORDER BY name

2019-01-24 00:54:27,723 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,746 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("sqladb")

INFO:sqlalchemy.engine.base.Engine:PRAGMA table_info("sqladb")

2019-01-24 00:54:27,748 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,748 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb' AND type = 'table'

INFO:sqlalchemy.engine.base.Engine:SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb' AND type = 'table'

2019-01-24 00:54:27,758 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,758 INFO sqlalchemy.engine.base.Engine PRAGMA foreign_key_list("sqladb")

INFO:sqlalchemy.engine.base.Engine:PRAGMA foreign_key_list("sqladb")

2019-01-24 00:54:27,758 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,768 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb' AND type = 'table'

INFO:sqlalchemy.engine.base.Engine:SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb' AND type = 'table'

2019-01-24 00:54:27,768 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,768 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("sqladb")

INFO:sqlalchemy.engine.base.Engine:PRAGMA index_list("sqladb")

2019-01-24 00:54:27,778 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,809 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("ix_sqladb_index")

INFO:sqlalchemy.engine.base.Engine:PRAGMA index_info("ix_sqladb_index")

2019-01-24 00:54:27,813 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,817 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("sqladb")

INFO:sqlalchemy.engine.base.Engine:PRAGMA index_list("sqladb")

2019-01-24 00:54:27,821 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,825 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("ix_sqladb_index")

INFO:sqlalchemy.engine.base.Engine:PRAGMA index_info("ix_sqladb_index")

2019-01-24 00:54:27,825 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,829 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb' AND type = 'table'

INFO:sqlalchemy.engine.base.Engine:SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'sqladb' AND type = 'table'

2019-01-24 00:54:27,833 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:27,841 INFO sqlalchemy.engine.base.Engine
DROP TABLE sqladb

INFO:sqlalchemy.engine.base.Engine:
DROP TABLE sqladb

2019-01-24 00:54:27,841 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:28,020 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2019-01-24 00:54:28,036 INFO sqlalchemy.engine.base.Engine
CREATE TABLE sqladb (
	"index" BIGINT,
	age BIGINT,
	workclass TEXT,
	fnlwgt BIGINT,
	education TEXT,
	"educationNum" BIGINT,
	marital_status TEXT,
	occupation TEXT,
	relationship TEXT,
	race TEXT,
	sex TEXT,
	capital_gain BIGINT,
	capital_loss BIGINT,
	hours_per_week BIGINT,
	native_country TEXT,
	income TEXT
)

INFO:sqlalchemy.engine.base.Engine:
CREATE TABLE sqladb (
	"index" BIGINT,
	age BIGINT,
	workclass TEXT,
	fnlwgt BIGINT,
	education TEXT,
	"educationNum" BIGINT,
	marital_status TEXT,
	occupation TEXT,
	relationship TEXT,
	race TEXT,
	sex TEXT,
	capital_gain BIGINT,
	capital_loss BIGINT,
	hours_per_week BIGINT,
	native_country TEXT,
	income TEXT
)

2019-01-24 00:54:28,048 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:28,188 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2019-01-24 00:54:28,192 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_sqladb_index ON sqladb ("index")

INFO:sqlalchemy.engine.base.Engine:CREATE INDEX ix_sqladb_index ON sqladb ("index")

2019-01-24 00:54:28,200 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2019-01-24 00:54:28,321 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2019-01-24 00:54:28,406 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)

INFO:sqlalchemy.engine.base.Engine:BEGIN (implicit)

2019-01-24 00:54:29,475 INFO sqlalchemy.engine.base.Engine INSERT INTO sqladb ("index", age, workclass, fnlwgt, education, "educationNum", marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

INFO:sqlalchemy.engine.base.Engine:INSERT INTO sqladb ("index", age, workclass, fnlwgt, education, "educationNum", marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

2019-01-24 00:54:29,475 INFO sqlalchemy.engine.base.Engine ((0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'), (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (4, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (5, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (6, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (7, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K')  ... displaying 10 of 32561 total bound parameter sets ...  (32559, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32560, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))

INFO:sqlalchemy.engine.base.Engine:((0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'), (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (4, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (5, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (6, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (7, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K')  ... displaying 10 of 32561 total bound parameter sets ...  (32559, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32560, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))

2019-01-24 00:54:29,971 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

[(0, 'index', 'BIGINT', 0, None, 0),
 (1, 'age', 'BIGINT', 0, None, 0),
 (2, 'workclass', 'TEXT', 0, None, 0),
 (3, 'fnlwgt', 'BIGINT', 0, None, 0),
 (4, 'education', 'TEXT', 0, None, 0),
 (5, 'educationNum', 'BIGINT', 0, None, 0),
 (6, 'marital_status', 'TEXT', 0, None, 0),
 (7, 'occupation', 'TEXT', 0, None, 0),
 (8, 'relationship', 'TEXT', 0, None, 0),
 (9, 'race', 'TEXT', 0, None, 0),
 (10, 'sex', 'TEXT', 0, None, 0),
 (11, 'capital_gain', 'BIGINT', 0, None, 0),
 (12, 'capital_loss', 'BIGINT', 0, None, 0),
 (13, 'hours_per_week', 'BIGINT', 0, None, 0),
 (14, 'native_country', 'TEXT', 0, None, 0),
 (15, 'income', 'TEXT', 0, None, 0)]

In [142]:
# Select 10 records from the adult sqladb
print(pd.read_sql_query('SELECT * FROM sqladb limit 10', connection))

   index  age          workclass  fnlwgt   education  educationNum  \
0      0   39          State-gov   77516   Bachelors            13
1      1   50   Self-emp-not-inc   83311   Bachelors            13
2      2   38            Private  215646     HS-grad             9
3      3   53            Private  234721        11th             7
4      4   28            Private  338409   Bachelors            13
5      5   37            Private  284582     Masters            14
6      6   49            Private  160187         9th             5
7      7   52   Self-emp-not-inc  209642     HS-grad             9
8      8   31            Private   45781     Masters            14
9      9   42            Private  159449   Bachelors            13

           marital_status          occupation    relationship    race  \
0           Never-married        Adm-clerical   Not-in-family   White
1      Married-civ-spouse     Exec-managerial         Husband   White
2                Divorced   Handlers-cleaners   Not-in-family   White
3      Married-civ-spouse   Handlers-cleaners         Husband   Black
4      Married-civ-spouse      Prof-specialty            Wife   Black
5      Married-civ-spouse     Exec-managerial            Wife   White
6   Married-spouse-absent       Other-service   Not-in-family   Black
7      Married-civ-spouse     Exec-managerial         Husband   White
8           Never-married      Prof-specialty   Not-in-family   White
9      Married-civ-spouse     Exec-managerial         Husband   White

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male          2174             0              40   United-States   <=50K
1     Male             0             0              13   United-States   <=50K
2     Male             0             0              40   United-States   <=50K
3     Male             0             0              40   United-States   <=50K
4   Female             0             0              40            Cuba   <=50K
5   Female             0             0              40   United-States   <=50K
6   Female             0             0              16         Jamaica   <=50K
7     Male             0             0              45   United-States    >50K
8   Female         14084             0              50   United-States    >50K
9     Male          5178             0              40   United-States    >50K

In [143]:
# Show me the average hours per week of all men who are working in private sector

cursor.execute('SELECT avg(hours_per_week) FROM sqladb WHERE workclass=" Private" and sex = " Male"')
output = cursor.fetchall()
print(output)

[(42.22122591006424,)]

In [144]:
# Show me the frequency table for education, occupation and relationship, separately
# education
cursor.execute('SELECT education, COUNT(*) FROM sqladb GROUP BY education')
output = cursor.fetchall()
display(output)

[(' 10th', 933),
 (' 11th', 1175),
 (' 12th', 433),
 (' 1st-4th', 168),
 (' 5th-6th', 333),
 (' 7th-8th', 646),
 (' 9th', 514),
 (' Assoc-acdm', 1067),
 (' Assoc-voc', 1382),
 (' Bachelors', 5355),
 (' Doctorate', 413),
 (' HS-grad', 10501),
 (' Masters', 1723),
 (' Preschool', 51),
 (' Prof-school', 576),
 (' Some-college', 7291)]

In [145]:
# Ocupation
cursor.execute('SELECT occupation, COUNT(*) FROM sqladb GROUP BY occupation')
output = cursor.fetchall()
display(output)

[(' ?', 1843),
 (' Adm-clerical', 3770),
 (' Armed-Forces', 9),
 (' Craft-repair', 4099),
 (' Exec-managerial', 4066),
 (' Farming-fishing', 994),
 (' Handlers-cleaners', 1370),
 (' Machine-op-inspct', 2002),
 (' Other-service', 3295),
 (' Priv-house-serv', 149),
 (' Prof-specialty', 4140),
 (' Protective-serv', 649),
 (' Sales', 3650),
 (' Tech-support', 928),
 (' Transport-moving', 1597)]

In [146]:
# Relationship
cursor.execute('SELECT relationship, COUNT(*) FROM sqladb GROUP BY relationship')
output = cursor.fetchall()
display(output)

[(' Husband', 13193),
 (' Not-in-family', 8305),
 (' Other-relative', 981),
 (' Own-child', 5068),
 (' Unmarried', 3446),
 (' Wife', 1568)]

In [147]:
# Are there any people who are married, working in private sector and having a masters degree
print(pd.read_sql_query('SELECT * FROM sqladb WHERE education=" Masters" AND workclass=" Private" AND marital_status=" Married-civ-spouse"',
                        connection).head(10))

   index  age workclass  fnlwgt education  educationNum       marital_status  \
0      5   37   Private  284582   Masters            14   Married-civ-spouse
1     87   33   Private  202051   Masters            14   Married-civ-spouse
2    100   76   Private  124191   Masters            14   Married-civ-spouse
3    188   31   Private   99928   Masters            14   Married-civ-spouse
4    198   35   Private  138992   Masters            14   Married-civ-spouse
5    311   34   Private  142897   Masters            14   Married-civ-spouse
6    361   62   Private  270092   Masters            14   Married-civ-spouse
7    405   41   Private  445382   Masters            14   Married-civ-spouse
8    435   33   Private  208405   Masters            14   Married-civ-spouse
9    468   49   Private  192776   Masters            14   Married-civ-spouse

         occupation     relationship                 race      sex  \
0   Exec-managerial             Wife                White   Female
1    Prof-specialty          Husband                White     Male
2   Exec-managerial          Husband                White     Male
3    Prof-specialty             Wife                White   Female
4    Prof-specialty   Other-relative                White     Male
5   Exec-managerial          Husband   Asian-Pac-Islander     Male
6    Prof-specialty          Husband                White     Male
7   Exec-managerial          Husband                White     Male
8    Prof-specialty          Husband                White     Male
9   Exec-managerial          Husband                White     Male

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              40   United-States   <=50K
1             0             0              50   United-States   <=50K
2             0             0              40   United-States    >50K
3             0             0              50   United-States   <=50K
4          7298             0              40   United-States    >50K
5          7298             0              35          Taiwan    >50K
6             0             0              40   United-States    >50K
7             0          1977              65   United-States    >50K
8             0             0              50   United-States    >50K
9             0          1977              45   United-States    >50K

In [148]:
# What is the average, minimum and maximum age group for people working in different sectors
# Minimum Age Group
cursor.execute('SELECT occupation, min(age) FROM sqladb GROUP BY occupation')
output = cursor.fetchall()
display("Minimum Age Group",output)

'Minimum Age Group'

[(' ?', 17),
 (' Adm-clerical', 17),
 (' Armed-Forces', 23),
 (' Craft-repair', 17),
 (' Exec-managerial', 17),
 (' Farming-fishing', 17),
 (' Handlers-cleaners', 17),
 (' Machine-op-inspct', 17),
 (' Other-service', 17),
 (' Priv-house-serv', 17),
 (' Prof-specialty', 17),
 (' Protective-serv', 17),
 (' Sales', 17),
 (' Tech-support', 17),
 (' Transport-moving', 17)]

In [149]:
# Maximum Age Group
cursor.execute('SELECT occupation, max(age) FROM sqladb GROUP BY occupation')
output = cursor.fetchall()
display("Maximum Age Group",output)

'Maximum Age Group'

[(' ?', 90),
 (' Adm-clerical', 90),
 (' Armed-Forces', 46),
 (' Craft-repair', 90),
 (' Exec-managerial', 90),
 (' Farming-fishing', 90),
 (' Handlers-cleaners', 90),
 (' Machine-op-inspct', 90),
 (' Other-service', 90),
 (' Priv-house-serv', 81),
 (' Prof-specialty', 90),
 (' Protective-serv', 90),
 (' Sales', 90),
 (' Tech-support', 73),
 (' Transport-moving', 90)]

In [150]:
# Average Age group
cursor.execute('SELECT occupation, avg(age) FROM sqladb GROUP BY occupation')
output = cursor.fetchall()
display("Average Age group",output)

'Average Age group'

[(' ?', 40.882799782962564),
 (' Adm-clerical', 36.96445623342175),
 (' Armed-Forces', 30.22222222222222),
 (' Craft-repair', 39.03147109050988),
 (' Exec-managerial', 42.16920806689621),
 (' Farming-fishing', 41.2112676056338),
 (' Handlers-cleaners', 32.16569343065694),
 (' Machine-op-inspct', 37.71528471528472),
 (' Other-service', 34.94962063732929),
 (' Priv-house-serv', 41.7248322147651),
 (' Prof-specialty', 40.51763285024155),
 (' Protective-serv', 38.9537750385208),
 (' Sales', 37.353972602739724),
 (' Tech-support', 37.022629310344826),
 (' Transport-moving', 40.19787100814026)]

In [151]:
# Calculate age distribution by country
cursor.execute('SELECT native_country, age FROM sqladb GROUP BY native_country')
output = cursor.fetchall()
display(output)

[(' ?', 81),
 (' Cambodia', 48),
 (' Canada', 32),
 (' China', 23),
 (' Columbia', 49),
 (' Cuba', 48),
 (' Dominican-Republic', 45),
 (' Ecuador', 27),
 (' El-Salvador', 39),
 (' England', 48),
 (' France', 64),
 (' Germany', 74),
 (' Greece', 23),
 (' Guatemala', 22),
 (' Haiti', 29),
 (' Holand-Netherlands', 32),
 (' Honduras', 30),
 (' Hong', 28),
 (' Hungary', 47),
 (' India', 23),
 (' Iran', 42),
 (' Ireland', 23),
 (' Italy', 41),
 (' Jamaica', 22),
 (' Japan', 54),
 (' Laos', 29),
 (' Mexico', 43),
 (' Nicaragua', 27),
 (' Outlying-US(Guam-USVI-etc)', 47),
 (' Peru', 25),
 (' Philippines', 39),
 (' Poland', 85),
 (' Portugal', 48),
 (' Puerto-Rico', 33),
 (' Scotland', 49),
 (' South', 22),
 (' Taiwan', 32),
 (' Thailand', 55),
 (' Trinadad&Tobago', 32),
 (' United-States', 52),
 (' Vietnam', 51),
 (' Yugoslavia', 29)]

In [162]:
# Compute a new column as 'Net-Capital-Gain' from the two columns 'capital_gain' and 'capital_loss'
cursor.execute('UPDATE sqladb SET capital_gain=capital_gain-capital_loss')

print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(10))

   index  age          workclass  fnlwgt   education  educationNum  \
0      0   39          State-gov   77516   Bachelors            13
1      1   50   Self-emp-not-inc   83311   Bachelors            13
2      2   38            Private  215646     HS-grad             9
3      3   53            Private  234721        11th             7
4      4   28            Private  338409   Bachelors            13
5      5   37            Private  284582     Masters            14
6      6   49            Private  160187         9th             5
7      7   52   Self-emp-not-inc  209642     HS-grad             9
8      8   31            Private   45781     Masters            14
9      9   42            Private  159449   Bachelors            13

           marital_status          occupation    relationship    race  \
0           Never-married        Adm-clerical   Not-in-family   White
1      Married-civ-spouse     Exec-managerial         Husband   White
2                Divorced   Handlers-cleaners   Not-in-family   White
3      Married-civ-spouse   Handlers-cleaners         Husband   Black
4      Married-civ-spouse      Prof-specialty            Wife   Black
5      Married-civ-spouse     Exec-managerial            Wife   White
6   Married-spouse-absent       Other-service   Not-in-family   Black
7      Married-civ-spouse     Exec-managerial         Husband   White
8           Never-married      Prof-specialty   Not-in-family   White
9      Married-civ-spouse     Exec-managerial         Husband   White

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male          2174             0              40   United-States   <=50K
1     Male             0             0              13   United-States   <=50K
2     Male             0             0              40   United-States   <=50K
3     Male             0             0              40   United-States   <=50K
4   Female             0             0              40            Cuba   <=50K
5   Female             0             0              40   United-States   <=50K
6   Female             0             0              16         Jamaica   <=50K
7     Male             0             0              45   United-States    >50K
8   Female         14084             0              50   United-States    >50K
9     Male          5178             0              40   United-States    >50K